In [31]:
# C

In [32]:
emp_id = c(1:5)

In [33]:
emp_name = c("aniket", "mahak", "seema", "prince", "mukul")

In [34]:
emp_name

[1] "aniket" "mahak"  "seema"  "prince" "mukul"

In [35]:
salary = c (100, 30.2, 200, 785, 455)

In [36]:
start_date = as.Date(c("2012-01-01","2013-09-20","2011-05-02","2015-12-20","2015-12-2000"))

In [37]:
emp.data <- data.frame(
    emp_id, 
    emp_name,
    salary,
    start_date,
    stringsAsFactors = FALSE  
)

In [38]:
emp.data

  emp_id emp_name salary start_date
1 1      aniket   100.0  2012-01-01
2 2      mahak     30.2  2013-09-20
3 3      seema    200.0  2011-05-02
4 4      prince   785.0  2015-12-20
5 5      mukul    455.0  2015-12-20

In [39]:
emp1.data <- data.frame(
    emp_id, 
    start_date,
    emp_name,
    salary,
    stringsAsFactors = FALSE  
)

In [40]:
emp1.data

  emp_id start_date emp_name salary
1 1      2012-01-01 aniket   100.0
2 2      2013-09-20 mahak     30.2
3 3      2011-05-02 seema    200.0
4 4      2015-12-20 prince   785.0
5 5      2015-12-20 mukul    455.0

In [41]:
# Structure of data
str(emp1.data)

'data.frame':	5 obs. of  4 variables:
 $ emp_id    : int  1 2 3 4 5
 $ start_date: Date, format: "2012-01-01" "2013-09-20" ...
 $ emp_name  : chr  "aniket" "mahak" "seema" "prince" ...
 $ salary    : num  100 30.2 200 785 455

In [42]:
#Summary of data:  Statistical summary of data
summary(emp1.data)

     emp_id    start_date           emp_name             salary
 Min.   :1   Min.   :2011-05-02   Length:5           Min.   : 30.2
 1st Qu.:2   1st Qu.:2012-01-01   Class :character   1st Qu.:100.0
 Median :3   Median :2013-09-20   Mode  :character   Median :200.0
 Mean   :3   Mean   :2013-10-18                      Mean   :314.0
 3rd Qu.:4   3rd Qu.:2015-12-20                      3rd Qu.:455.0
 Max.   :5   Max.   :2015-12-20                      Max.   :785.0

In [50]:
name <-  emp.data$emp_name
print(name)
sala <- emp.data$salary
print(sala)

[1] "aniket" "mahak"  "seema"  "prince" "mukul"
[1] 100.0  30.2 200.0 785.0 455.0

In [66]:
test_data <- data.frame(emp.data$emp_name,emp.data$salary)
#print(test_data)
emp.data

  emp_id emp_name salary start_date
1 1      aniket   100.0  2012-01-01
2 2      mahak     30.2  2013-09-20
3 3      seema    200.0  2011-05-02
4 4      prince   785.0  2015-12-20
5 5      mukul    455.0  2015-12-20

In [68]:
pdata <- emp.data[c(4), c(4)]  # first c  is row number and second c is column number
print(pdata)

[1] "2015-12-20"

In [67]:
emp.data[c(5),c(2)]

[1] "mukul"

In [74]:
rdata <- emp.data[c(2, 5), c(2, 3, 4)]
print(rdata)

  emp_name salary start_date
2    mahak   30.2 2013-09-20
5    mukul  455.0 2015-12-20

In [77]:
# Expand the existing dataframe
emp_deprt = c("IT", "Eductaion", "Finace", "Defence", "selfemployed")
print(emp_deprt)

[1] "IT"           "Eductaion"    "Finace"       "Defence"      "selfemployed"

In [78]:
emp.data$depart <- emp_deprt       # added a new column in the existing dataframe

In [79]:
print(emp.data)

  emp_id emp_name salary start_date       depart
1      1   aniket  100.0 2012-01-01           IT
2      2    mahak   30.2 2013-09-20    Eductaion
3      3    seema  200.0 2011-05-02       Finace
4      4   prince  785.0 2015-12-20      Defence
5      5    mukul  455.0 2015-12-20 selfemployed

In [80]:
str(emp.data)

'data.frame':	5 obs. of  5 variables:
 $ emp_id    : int  1 2 3 4 5
 $ emp_name  : chr  "aniket" "mahak" "seema" "prince" ...
 $ salary    : num  100 30.2 200 785 455
 $ start_date: Date, format: "2012-01-01" "2013-09-20" ...
 $ depart    : chr  "IT" "Eductaion" "Finace" "Defence" ...

In [82]:
summary(emp.data)

     emp_id    emp_name             salary        start_date
 Min.   :1   Length:5           Min.   : 30.2   Min.   :2011-05-02
 1st Qu.:2   Class :character   1st Qu.:100.0   1st Qu.:2012-01-01
 Median :3   Mode  :character   Median :200.0   Median :2013-09-20
 Mean   :3                      Mean   :314.0   Mean   :2013-10-18
 3rd Qu.:4                      3rd Qu.:455.0   3rd Qu.:2015-12-20
 Max.   :5                      Max.   :785.0   Max.   :2015-12-20
    depart
 Length:5
 Class :character
 Mode  :character

In [88]:
# Add new object (row in the table) 
new_row = data.frame(6, 'Saket', 200, "2013-10-10", 'education')

In [89]:
new_row

  X6 X.Saket. X200 X.2013.10.10. X.education.
1 6  Saket    200  2013-10-10    education